In [1]:
import pandas as pd

In [2]:
new_s = pd.Series([10,20,30,40])

In [3]:
new_s

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
put_index = pd.Series([10,20,30,40], index=["a","b","c","d"])

In [5]:
put_index

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
colors = ["red", "orange", "yellow", "white"]
degrees = [30, 40, 50, 60]
numbers = [11,12,13,14]

new_df = pd.DataFrame({"colors": colors, "degrees": degrees, "numbers": numbers}, columns= ["colors", "degrees", "numbers"],
index=range(1,5))

In [7]:
new_df

   colors  degrees  numbers
1     red       30       11
2  orange       40       12
3  yellow       50       13
4   white       60       14

In [8]:
df_csv = pd.read_csv("./sample10.csv", low_memory=False)

In [9]:
df_csv

   No   Cars  numbers  year  price
0   1   Car1      123  2005   5000
1   2   Car2      456  2006   6000
2   3   Car3      789  2007   7000
3   4   Car4     1011  2008   8000
4   5   Car5     1213  2009   9000
5   6   Car6     1415  2010  10000
6   7   Car7     1617  2011  11000
7   8   Car8     1819  2012  12000
8   9   Car9     2011  2013  13000
9  10  Car10     2356  2014  14000

In [10]:
df_csv.head(6)

   No  Cars  numbers  year  price
0   1  Car1      123  2005   5000
1   2  Car2      456  2006   6000
2   3  Car3      789  2007   7000
3   4  Car4     1011  2008   8000
4   5  Car5     1213  2009   9000
5   6  Car6     1415  2010  10000

In [11]:
new_url = "https://en.wikipedia.org/wiki/Academy_Awards"

In [13]:
new_html = pd.read_html(new_url, header=0, index_col=0)[3]

In [15]:
new_html.head(5)

,Unnamed: 1,Unnamed: 2
Award,Best Actor,Best Actress
Winner,Anthony Hopkins(The Father),Frances McDormand(Nomadland)
NaN,NaN,NaN
Award,Best Supporting Actor,Best Supporting Actress
Winner,Daniel Kaluuya(Judas and the Black Messiah),Youn Yuh-jung(Minari)

In [16]:
df_csv

   No   Cars  numbers  year  price
0   1   Car1      123  2005   5000
1   2   Car2      456  2006   6000
2   3   Car3      789  2007   7000
3   4   Car4     1011  2008   8000
4   5   Car5     1213  2009   9000
5   6   Car6     1415  2010  10000
6   7   Car7     1617  2011  11000
7   8   Car8     1819  2012  12000
8   9   Car9     2011  2013  13000
9  10  Car10     2356  2014  14000

In [17]:
df_csv.shape

(10, 5)